#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-lambda-cost.data.archive_file.aws_lambda_cost will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "aws_lambda_cost"  {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/aws-lambda-cost/lambda.zip"
      + output_sha          = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "modules/aws-lambda-cost/main.py"
      + type                = "zip"
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.670+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-lambda-cost.aws_lambda_function.aws_lambda_cost_log will be updated in-place
  ~ resource "aws_lambda_function" "aws_lambda_cost_log" {
        arn                            = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log"
        filename                       = "modules/aws-lambda-cost/lambda.zip"
        function_name                  = "aws-lambda-cost-log"
        handler                        = "main.lambda_handler"
        id                             = "aws-lambda-cost-log"
        invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log/invocations"
      ~ last_modified                  = "2020-03-03T07:59:33.345+0000" -> (known after apply)
        layers                         = []
        memory_size                    = 128
        publish                        = false
        qualified_arn                  = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost-log:$LATEST"
        reserved_concurrent_executions = -1
        role                           = "arn:aws:iam::589845989135:role/aws-lambda-cost"
        runtime                        = "python3.7"
      ~ source_code_hash               = "9ZjLnjzehmaucV1rk6qMTg2S6a0koKPnq+07RQvmDOY=" -> (known after apply)
        source_code_size               = 914
        tags                           = {}
        timeout                        = 3
        version                        = "$LATEST"

        environment {
            variables = {
                "SLACK_CHANNEL_NAME" = "aws-cost-log"
                "SLACK_POST_URL"     = "https://hooks.slack.com/services/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"
            }
        }

        tracing_config {
            mode = "PassThrough"
        }
    }

  # module.aws-route-53.aws_route53_record.k8s_shunkakinoki_com_CNAME will be destroyed
  - resource "aws_route53_record" "k8s_shunkakinoki_com_CNAME" {
      - fqdn    = "k8s.shunkakinoki.com" -> null
      - id      = "Z19V0BNFYY29A_k8s.shunkakinoki.com._CNAME" -> null
      - name    = "k8s.shunkakinoki.com" -> null
      - records = [
          - "usw1.kubesail.io",
        ] -> null
      - ttl     = 300 -> null
      - type    = "CNAME" -> null
      - zone_id = "Z19V0BNFYY29A" -> null
    }

  # module.aws-route-53.aws_route53_record.k8s_shunkakinoki_com_NS must be replaced
-/+ resource "aws_route53_record" "k8s_shunkakinoki_com_NS" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "k8s.$paws_route53_zone.shunkakinoki.name}.shunkakinoki.com" -> (known after apply)
      ~ id              = "Z19V0BNFYY29A_k8s.$paws_route53_zone.shunkakinoki.name}_NS" -> (known after apply)
      ~ name            = "k8s.$paws_route53_zone.shunkakinoki.name}" -> "k8s.shunkakinoki.com" # forces replacement
        records         = [
            "ns-1051.awsdns-03.org",
            "ns-1701.awsdns-20.co.uk",
            "ns-292.awsdns-36.com",
            "ns-913.awsdns-50.net",
        ]
        ttl             = 300
        type            = "NS"
        zone_id         = "Z19V0BNFYY29A"
    }

Plan: 1 to add, 2 to change, 2 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
